; ModuleID = 'fg_3_3_3sa.c'
source_filename = "fg_3_3_3sa.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TAG_FG_3_3_3SA_RAW = type { double, double, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i16, i16, i16, i8 }

@Fg333sacntFrame = dso_local global i32 0, align 4, !dbg !0

; Function Attrs: noinline nounwind optnone uwtable
define dso_local i32 @SendFg333saCmd(ptr noundef %0) #0 !dbg !48 {
  %2 = alloca ptr, align 8
  %3 = alloca i32, align 4
  store ptr %0, ptr %2, align 8
  call void @llvm.dbg.declare(metadata ptr %2, metadata !53, metadata !DIExpression()), !dbg !54
  call void @llvm.dbg.declare(metadata ptr %3, metadata !55, metadata !DIExpression()), !dbg !56
  %4 = load ptr, ptr %2, align 8, !dbg !57
  %5 = getelementptr inbounds i8, ptr %4, i64 0, !dbg !57
  store i8 -21, ptr %5, align 1, !dbg !58
  %6 = load ptr, ptr %2, align 8, !dbg !59
  %7 = getelementptr inbounds i8, ptr %6, i64 1, !dbg !59
  store i8 -112, ptr %7, align 1, !dbg !60
  store i32 2, ptr %3, align 4, !dbg !61
  %8 = load i32, ptr %3, align 4, !dbg !62
  ret i32 %8, !dbg !63
}

; Function Attrs: nocallback nofree nosync nounwind speculatable willreturn memory(none)
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "Fg333sacntFrame", scope: !2, file: !3, line: 5, type: !16, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0 (https://github.com/zbchen/GVFG-LLVM.git a44eb0d204ec5f401fb9df0f956112e21f6cf859)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !39, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "fg_3_3_3sa.c", directory: "/home/lkl/SoftwareIP/SIP/test/\E5\8E\9F\E5\A7\8B\E8\BE\93\E5\85\A5/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F2", checksumkind: CSK_MD5, checksum: "3cfae7693f67b6cc4fa35e8832aa12a8")
!4 = !{!5, !16, !11, !20, !32}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFg333saRaw", file: !7, line: 32, baseType: !8)
!7 = !DIFile(filename: "./fg_3_3_3sa.h", directory: "/home/lkl/SoftwareIP/SIP/test/\E5\8E\9F\E5\A7\8B\E8\BE\93\E5\85\A5/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F2", checksumkind: CSK_MD5, checksum: "9fbbc49f5b7e542a48f527a2161899c7")
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_FG_3_3_3SA_RAW", file: !7, line: 8, size: 576, elements: !9)
!9 = !{!10, !14, !15, !18, !19, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !34, !35, !36}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "gf", scope: !8, file: !7, line: 10, baseType: !11, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "float64", file: !12, line: 17, baseType: !13)
!12 = !DIFile(filename: "./std_basal.h", directory: "/home/lkl/SoftwareIP/SIP/test/\E5\8E\9F\E5\A7\8B\E8\BE\93\E5\85\A5/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F/\E5\8E\9F\E5\A7\8BSAM\E6\BA\90\E7\A8\8B\E5\BA\8F2", checksumkind: CSK_MD5, checksum: "e6894d170243f183681360646add8143")
!13 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "wt0", scope: !8, file: !7, line: 11, baseType: !11, size: 64, offset: 64)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "cntFrame", scope: !8, file: !7, line: 12, baseType: !16, size: 32, offset: 128)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint32", file: !12, line: 15, baseType: !17)
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "bComSuc", scope: !8, file: !7, line: 14, baseType: !16, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "cntLenRd", scope: !8, file: !7, line: 16, baseType: !20, size: 32, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "siint32", file: !12, line: 14, baseType: !21)
!21 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "cntHead", scope: !8, file: !7, line: 17, baseType: !20, size: 32, offset: 224)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "cntLen", scope: !8, file: !7, line: 18, baseType: !20, size: 32, offset: 256)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "cntCheck", scope: !8, file: !7, line: 19, baseType: !20, size: 32, offset: 288)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "cntUpdata", scope: !8, file: !7, line: 20, baseType: !20, size: 32, offset: 320)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "totalLenRd", scope: !8, file: !7, line: 22, baseType: !20, size: 32, offset: 352)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "totalHead", scope: !8, file: !7, line: 23, baseType: !20, size: 32, offset: 384)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "totalLen", scope: !8, file: !7, line: 24, baseType: !20, size: 32, offset: 416)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "totalCheck", scope: !8, file: !7, line: 25, baseType: !20, size: 32, offset: 448)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "totalUpdata", scope: !8, file: !7, line: 26, baseType: !20, size: 32, offset: 480)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "glwd1", scope: !8, file: !7, line: 28, baseType: !32, size: 16, offset: 512)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint16", file: !12, line: 13, baseType: !33)
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "glwd2", scope: !8, file: !7, line: 29, baseType: !32, size: 16, offset: 528)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "dlwd", scope: !8, file: !7, line: 30, baseType: !32, size: 16, offset: 544)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !8, file: !7, line: 31, baseType: !37, size: 8, offset: 560)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint08", file: !12, line: 11, baseType: !38)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!0}
!40 = !{i32 7, !"Dwarf Version", i32 5}
!41 = !{i32 2, !"Debug Info Version", i32 3}
!42 = !{i32 1, !"wchar_size", i32 4}
!43 = !{i32 8, !"PIC Level", i32 2}
!44 = !{i32 7, !"PIE Level", i32 2}
!45 = !{i32 7, !"uwtable", i32 2}
!46 = !{i32 7, !"frame-pointer", i32 2}
!47 = !{!"clang version 16.0.0 (https://github.com/zbchen/GVFG-LLVM.git a44eb0d204ec5f401fb9df0f956112e21f6cf859)"}
!48 = distinct !DISubprogram(name: "SendFg333saCmd", scope: !3, file: !3, line: 8, type: !49, scopeLine: 9, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !52)
!49 = !DISubroutineType(types: !50)
!50 = !{!16, !51}
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!52 = !{}
!53 = !DILocalVariable(name: "pSendBuf", arg: 1, scope: !48, file: !3, line: 8, type: !51)
!54 = !DILocation(line: 8, column: 33, scope: !48)
!55 = !DILocalVariable(name: "tmpLen", scope: !48, file: !3, line: 10, type: !16)
!56 = !DILocation(line: 10, column: 10, scope: !48)
!57 = !DILocation(line: 13, column: 5, scope: !48)
!58 = !DILocation(line: 13, column: 17, scope: !48)
!59 = !DILocation(line: 14, column: 5, scope: !48)
!60 = !DILocation(line: 14, column: 17, scope: !48)
!61 = !DILocation(line: 16, column: 9, scope: !48)
!62 = !DILocation(line: 18, column: 12, scope: !48)
!63 = !DILocation(line: 18, column: 5, scope: !48)
!64 = distinct !DISubprogram(name: "Fg333saCheck", scope: !3, file: !3, line: 23, type: !65, scopeLine: 24, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !52)
!65 = !DISubroutineType(types: !66)
!66 = !{!16, !67, !16, !69, !69}
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !37)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!70 = !DILocalVariable(name: "pbuff", arg: 1, scope: !64, file: !3, line: 23, type: !67)
!71 = !DILocation(line: 23, column: 37, scope: !64)
!72 = !DILocalVariable(name: "rdLen", arg: 2, scope: !64, file: !3, line: 23, type: !16)
!73 = !DILocation(line: 23, column: 52, scope: !64)
!74 = !DILocalVariable(name: "frm", arg: 3, scope: !64, file: !3, line: 23, type: !69)
!75 = !DILocation(line: 23, column: 68, scope: !64)
!76 = !DILocalVariable(name: "pFgRaw", arg: 4, scope: !64, file: !3, line: 23, type: !69)
!77 = !DILocation(line: 23, column: 82, scope: !64)
!78 = !DILocalVariable(name: "bComSuc", scope: !64, file: !3, line: 25, type: !16)
!79 = !DILocation(line: 25, column: 10, scope: !64)
!80 = !DILocalVariable(name: "chksum", scope: !64, file: !3, line: 26, type: !37)
!81 = !DILocation(line: 26, column: 10, scope: !64)
!82 = !DILocalVariable(name: "pRaw", scope: !64, file: !3, line: 27, type: !5)
!83 = !DILocation(line: 27, column: 15, scope: !64)
!84 = !DILocation(line: 29, column: 24, scope: !64)
!85 = !DILocation(line: 29, column: 7, scope: !64)
!86 = !DILocation(line: 31, column: 10, scope: !64)
!87 = !DILocation(line: 33, column: 5, scope: !88)
!88 = distinct !DILexicalBlock(scope: !64, file: !3, line: 33, column: 5)
!89 = !DILocation(line: 33, column: 11, scope: !88)
!90 = !DILocation(line: 33, column: 5, scope: !64)
!91 = !DILocation(line: 35, column: 3, scope: !92)
!92 = distinct !DILexicalBlock(scope: !88, file: !3, line: 34, column: 2)
!93 = !DILocation(line: 35, column: 9, scope: !92)
!94 = !DILocation(line: 35, column: 18, scope: !92)
!95 = !DILocation(line: 38, column: 7, scope: !96)
!96 = distinct !DILexicalBlock(scope: !92, file: !3, line: 38, column: 7)
!97 = !DILocation(line: 38, column: 22, scope: !96)
!98 = !DILocation(line: 38, column: 21, scope: !96)
!99 = !DILocation(line: 38, column: 17, scope: !96)
