; ModuleID = 'var.c'
source_filename = "var.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.TAG_CONTROLLER_PARAM = type { float, float, float }
%union.TAG_INPUT_IO1_STATUS = type { i32 }
%union.TAG_INPUT_IO2 = type { i32 }
%union.TAG_INPUT_IO3_UPS = type { i32 }
%union.TAG_INPUT_HEALTH_HI = type { i32 }
%union.TAG_INPUT_HEALTH_LO = type { i32 }
%union.TAG_POWER_STATUS1 = type { i32 }
%union.TAG_POWER_STATUS2 = type { i32 }
%union.TAG_POWER_STATUS3 = type { i32 }
%struct.TAG_ATTITUDE_PARA = type { [3 x float], [3 x float] }
%struct.TAG_DSS_DATA = type { i32, i32, float, float }
%struct.TAG_DIGITAL_GYRO_DATA = type { [9 x i8], [3 x float], [9 x float], [9 x float], i8, i32, i32, [3 x float], [9 x i8], [9 x i8], [3 x [5 x float]] }
%struct.TAG_CONTROLLERIN = type { float, float, float }
%struct.TAG_FALSE_RATE_MODULATOR = type { float, float, i8, i8 }
%struct.TAG_UPS_2MS = type { i32, i8 }
%struct.TAG_FAULT_WARNING = type { i8, i8, i8, i8, i8, i8, i8, i32, i32, i32, i32, i32 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CTRL_PARAM_SAM", scope: !2, file: !3, line: 11, type: !290, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "clang version 16.0.0 (https://github.com/zbchen/GVFG-LLVM.git a44eb0d204ec5f401fb9df0f956112e21f6cf859)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "var.c", directory: "/home/lkl/SoftwareIP/SIP/test/app_old", checksumkind: CSK_MD5, checksum: "4f0bbf09384f4ed4dd7840f431b44301")
!4 = !{!0, !5, !14, !18, !21, !23, !27, !29, !31, !35, !37, !39, !42, !45, !63, !81, !99, !123, !148, !166, !184, !201, !203, !205, !207, !216, !225, !247, !256, !266, !273}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "VG", scope: !2, file: !3, line: 19, type: !7, isLocal: false, isDefinition: true)
!7 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 864, elements: !11)
!8 = !DIDerivedType(tag: DW_TAG_typedef, name: "float32", file: !9, line: 9, baseType: !10)
!9 = !DIFile(filename: "./ty.h", directory: "/home/lkl/SoftwareIP/SIP/test/app_old", checksumkind: CSK_MD5, checksum: "f671dcd8fafaa978c2074b060031d1e5")
!10 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!11 = !{!12, !13}
!12 = !DISubrange(count: 9)
!13 = !DISubrange(count: 3)
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "nouse", scope: !2, file: !3, line: 32, type: !16, isLocal: false, isDefinition: true)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint08", file: !9, line: 3, baseType: !17)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIGlobalVariableExpression(var: !19, expr: !DIExpression())
!19 = distinct !DIGlobalVariable(name: "countInt32ms", scope: !2, file: !3, line: 35, type: !20, isLocal: false, isDefinition: true)
!20 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !16)
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "Count192ms", scope: !2, file: !3, line: 36, type: !20, isLocal: false, isDefinition: true)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "countSate", scope: !2, file: !3, line: 37, type: !25, isLocal: false, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint32", file: !9, line: 8, baseType: !26)
!26 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "countPublic", scope: !2, file: !3, line: 38, type: !25, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "countMode", scope: !2, file: !3, line: 39, type: !25, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "flgPRSAM", scope: !2, file: !3, line: 42, type: !33, isLocal: false, isDefinition: true)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "unint16", file: !9, line: 6, baseType: !34)
!34 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "flgGryoCalc", scope: !2, file: !3, line: 43, type: !20, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "flgNPC", scope: !2, file: !3, line: 44, type: !33, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "flg160INT", scope: !2, file: !3, line: 45, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !33)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "mFTdata", scope: !2, file: !3, line: 46, type: !44, isLocal: false, isDefinition: true)
!44 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !25)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "mInpIO1", scope: !2, file: !3, line: 49, type: !47, isLocal: false, isDefinition: true)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInpIO1", file: !9, line: 204, baseType: !48)
!48 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_INPUT_IO1_STATUS", file: !9, line: 186, size: 32, elements: !49)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !48, file: !9, line: 188, baseType: !33, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !48, file: !9, line: 202, baseType: !52, size: 32)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_INPUT_IO1_STATUS_BIT", file: !9, line: 190, size: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "SSE_A", scope: !52, file: !9, line: 193, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "SSE_B", scope: !52, file: !9, line: 194, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "FOG1", scope: !52, file: !9, line: 195, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "FOG2", scope: !52, file: !9, line: 196, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "FOG3", scope: !52, file: !9, line: 197, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO4", scope: !52, file: !9, line: 198, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO5", scope: !52, file: !9, line: 199, baseType: !33, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO6", scope: !52, file: !9, line: 200, baseType: !33, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !52, file: !9, line: 201, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "mInpIO2", scope: !2, file: !3, line: 50, type: !65, isLocal: false, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInpIO2", file: !9, line: 224, baseType: !66)
!66 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_INPUT_IO2", file: !9, line: 207, size: 32, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !66, file: !9, line: 209, baseType: !33, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !66, file: !9, line: 222, baseType: !70, size: 32)
!70 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_INPUT_IO2_BIT", file: !9, line: 211, size: 32, elements: !71)
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO_1", scope: !70, file: !9, line: 213, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO_2", scope: !70, file: !9, line: 214, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO_3", scope: !70, file: !9, line: 215, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "SADA", scope: !70, file: !9, line: 216, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "LV14", scope: !70, file: !9, line: 217, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "LV23", scope: !70, file: !9, line: 218, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "BUS_AB_G", scope: !70, file: !9, line: 219, baseType: !33, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "LV1234_G", scope: !70, file: !9, line: 220, baseType: !33, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !70, file: !9, line: 221, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "mInpIO3", scope: !2, file: !3, line: 51, type: !83, isLocal: false, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "UInpIO3", file: !9, line: 245, baseType: !84)
!84 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_INPUT_IO3_UPS", file: !9, line: 227, size: 32, elements: !85)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !84, file: !9, line: 229, baseType: !33, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !84, file: !9, line: 244, baseType: !88, size: 32)
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_INPUT_IO3_UPS_BIT", file: !9, line: 231, size: 32, elements: !89)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "GAE_135", scope: !88, file: !9, line: 234, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "GAE_246", scope: !88, file: !9, line: 235, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_2AB", scope: !88, file: !9, line: 236, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_3AB", scope: !88, file: !9, line: 237, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_4AB", scope: !88, file: !9, line: 238, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_5AB", scope: !88, file: !9, line: 239, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_6AB", scope: !88, file: !9, line: 240, baseType: !33, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "PULSE_7AB", scope: !88, file: !9, line: 241, baseType: !33, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !88, file: !9, line: 242, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!99 = !DIGlobalVariableExpression(var: !100, expr: !DIExpression())
!100 = distinct !DIGlobalVariable(name: "mHealthwordHi", scope: !2, file: !3, line: 52, type: !101, isLocal: false, isDefinition: true)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "UHealthwordHi", file: !9, line: 270, baseType: !102)
!102 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_INPUT_HEALTH_HI", file: !9, line: 247, size: 32, elements: !103)
!103 = !{!104, !105}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !102, file: !9, line: 249, baseType: !33, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !102, file: !9, line: 269, baseType: !106, size: 32)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_INPUT_HEALTH_BIT_HI", file: !9, line: 251, size: 32, elements: !107)
!107 = !{!108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "J_STS_1", scope: !106, file: !9, line: 253, baseType: !34, size: 1, flags: DIFlagBitField, extraData: i64 0)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "J_STS_2", scope: !106, file: !9, line: 254, baseType: !34, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "J_STS_3", scope: !106, file: !9, line: 255, baseType: !34, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_1", scope: !106, file: !9, line: 256, baseType: !34, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_2", scope: !106, file: !9, line: 257, baseType: !34, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_3", scope: !106, file: !9, line: 258, baseType: !34, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_4", scope: !106, file: !9, line: 259, baseType: !34, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_5", scope: !106, file: !9, line: 260, baseType: !34, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_6", scope: !106, file: !9, line: 261, baseType: !34, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_7", scope: !106, file: !9, line: 262, baseType: !34, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_8", scope: !106, file: !9, line: 263, baseType: !34, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "J_GA_9", scope: !106, file: !9, line: 264, baseType: !34, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "BAKB13", scope: !106, file: !9, line: 265, baseType: !34, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "J_OBC", scope: !106, file: !9, line: 266, baseType: !34, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "BAKBH", scope: !106, file: !9, line: 267, baseType: !34, size: 2, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "mHealthwordLo", scope: !2, file: !3, line: 53, type: !125, isLocal: false, isDefinition: true)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "UHealthwordLo", file: !9, line: 296, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_INPUT_HEALTH_LO", file: !9, line: 272, size: 32, elements: !127)
!127 = !{!128, !129}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !126, file: !9, line: 274, baseType: !33, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !126, file: !9, line: 295, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_INPUT_HEALTH_BIT_LO", file: !9, line: 276, size: 32, elements: !131)
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "J_UPS_A", scope: !130, file: !9, line: 278, baseType: !34, size: 1, flags: DIFlagBitField, extraData: i64 0)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "J_UPS_B", scope: !130, file: !9, line: 279, baseType: !34, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "J_SADAE_A", scope: !130, file: !9, line: 280, baseType: !34, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "J_SADAE_B", scope: !130, file: !9, line: 281, baseType: !34, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW1", scope: !130, file: !9, line: 282, baseType: !34, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW2", scope: !130, file: !9, line: 283, baseType: !34, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW3", scope: !130, file: !9, line: 284, baseType: !34, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW4", scope: !130, file: !9, line: 285, baseType: !34, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW5", scope: !130, file: !9, line: 286, baseType: !34, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW6", scope: !130, file: !9, line: 287, baseType: !34, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW7", scope: !130, file: !9, line: 288, baseType: !34, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "J_MW8", scope: !130, file: !9, line: 289, baseType: !34, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "J_SSE_A", scope: !130, file: !9, line: 290, baseType: !34, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "J_SSE_B", scope: !130, file: !9, line: 291, baseType: !34, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "J_FT_A", scope: !130, file: !9, line: 292, baseType: !34, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "J_FT_B", scope: !130, file: !9, line: 293, baseType: !34, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "mPowerword1", scope: !2, file: !3, line: 54, type: !150, isLocal: false, isDefinition: true)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "UPowerWord1", file: !9, line: 142, baseType: !151)
!151 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_POWER_STATUS1", file: !9, line: 123, size: 32, elements: !152)
!152 = !{!153, !154}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !151, file: !9, line: 125, baseType: !33, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !151, file: !9, line: 140, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_POWER_STATUS_BIT1", file: !9, line: 127, size: 32, elements: !156)
!156 = !{!157, !158, !159, !160, !161, !162, !163, !164, !165}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "FT_A_PS", scope: !155, file: !9, line: 130, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "FT_B_PS", scope: !155, file: !9, line: 131, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "OBC_A_PS", scope: !155, file: !9, line: 132, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "OBC_B_PS", scope: !155, file: !9, line: 133, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "OBC_A_DUTY", scope: !155, file: !9, line: 134, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "OBC_B_DUTY", scope: !155, file: !9, line: 135, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "SADA_A_PS", scope: !155, file: !9, line: 136, baseType: !33, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "SADA_B_PS", scope: !155, file: !9, line: 137, baseType: !33, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !155, file: !9, line: 138, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "mPowerword2", scope: !2, file: !3, line: 55, type: !168, isLocal: false, isDefinition: true)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "UPowerWord2", file: !9, line: 163, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_POWER_STATUS2", file: !9, line: 145, size: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !169, file: !9, line: 147, baseType: !33, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !169, file: !9, line: 161, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_POWER_STATUS_BIT2", file: !9, line: 149, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179, !180, !181, !182, !183}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "SSE_A_PS", scope: !173, file: !9, line: 152, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "SSE_B_PS", scope: !173, file: !9, line: 153, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "FOG1_PS", scope: !173, file: !9, line: 154, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "FOG2_PS", scope: !173, file: !9, line: 155, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "FOG3_PS", scope: !173, file: !9, line: 156, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO1_PS", scope: !173, file: !9, line: 157, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO2_PS", scope: !173, file: !9, line: 158, baseType: !33, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO3_PS", scope: !173, file: !9, line: 159, baseType: !33, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !173, file: !9, line: 160, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "mPowerword3", scope: !2, file: !3, line: 56, type: !186, isLocal: false, isDefinition: true)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "UPowerWord3", file: !9, line: 183, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "TAG_POWER_STATUS3", file: !9, line: 166, size: 32, elements: !188)
!188 = !{!189, !190}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ui16", scope: !187, file: !9, line: 168, baseType: !33, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "Bit", scope: !187, file: !9, line: 181, baseType: !191, size: 32)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_POWER_STATUS_BIT3", file: !9, line: 170, size: 32, elements: !192)
!192 = !{!193, !194, !195, !196, !197, !198, !199, !200}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO4_PS", scope: !191, file: !9, line: 173, baseType: !33, size: 1, flags: DIFlagBitField, extraData: i64 0)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO5_PS", scope: !191, file: !9, line: 174, baseType: !33, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "GYRO6_PS", scope: !191, file: !9, line: 175, baseType: !33, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "UPS_A_PS", scope: !191, file: !9, line: 176, baseType: !33, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "UPS_B_PS", scope: !191, file: !9, line: 177, baseType: !33, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "SPSee", scope: !191, file: !9, line: 178, baseType: !33, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "BAK", scope: !191, file: !9, line: 179, baseType: !33, size: 2, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "BAKH8", scope: !191, file: !9, line: 180, baseType: !33, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "mPCPowerword1", scope: !2, file: !3, line: 57, type: !150, isLocal: false, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "mPCPowerword2", scope: !2, file: !3, line: 58, type: !168, isLocal: false, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "mPCPowerword3", scope: !2, file: !3, line: 59, type: !186, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "mAttitude", scope: !2, file: !3, line: 62, type: !209, isLocal: false, isDefinition: true)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "SAttitude", file: !9, line: 30, baseType: !210)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_ATTITUDE_PARA", file: !9, line: 24, size: 192, elements: !211)
!211 = !{!212, !215}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "angle", scope: !210, file: !9, line: 27, baseType: !213, size: 96)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 96, elements: !214)
!214 = !{!13}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !210, file: !9, line: 28, baseType: !213, size: 96, offset: 96)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "mDSSData", scope: !2, file: !3, line: 63, type: !218, isLocal: false, isDefinition: true)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "SDSSData", file: !9, line: 41, baseType: !219)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_DSS_DATA", file: !9, line: 33, size: 128, elements: !220)
!220 = !{!221, !222, !223, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "SS1", scope: !219, file: !9, line: 36, baseType: !33, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "SS2", scope: !219, file: !9, line: 37, baseType: !33, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "royaw", scope: !219, file: !9, line: 38, baseType: !8, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "piyaw", scope: !219, file: !9, line: 39, baseType: !8, size: 32, offset: 96)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "mGyroData", scope: !2, file: !3, line: 64, type: !227, isLocal: false, isDefinition: true)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "SGyroData", file: !9, line: 59, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_DIGITAL_GYRO_DATA", file: !9, line: 44, size: 1600, elements: !229)
!229 = !{!230, !233, !234, !236, !237, !238, !239, !240, !241, !242, !243}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "countPick", scope: !228, file: !9, line: 47, baseType: !231, size: 72)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 72, elements: !232)
!232 = !{!12}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Gi", scope: !228, file: !9, line: 48, baseType: !213, size: 96, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "wa", scope: !228, file: !9, line: 49, baseType: !235, size: 288, offset: 192)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 288, elements: !232)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "wal", scope: !228, file: !9, line: 50, baseType: !235, size: 288, offset: 480)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "JoinTotal", scope: !228, file: !9, line: 51, baseType: !16, size: 8, offset: 768)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "gyroStatus0", scope: !228, file: !9, line: 52, baseType: !33, size: 32, offset: 800)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "gyroStatus1", scope: !228, file: !9, line: 53, baseType: !33, size: 32, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "W", scope: !228, file: !9, line: 54, baseType: !213, size: 96, offset: 864)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "SignFlag", scope: !228, file: !9, line: 55, baseType: !231, size: 72, offset: 960)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "StateFlag", scope: !228, file: !9, line: 56, baseType: !231, size: 72, offset: 1032)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Rtemp", scope: !228, file: !9, line: 57, baseType: !244, size: 480, offset: 1120)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 480, elements: !245)
!245 = !{!13, !246}
!246 = !DISubrange(count: 5)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "mController", scope: !2, file: !3, line: 65, type: !249, isLocal: false, isDefinition: true)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 288, elements: !214)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "SController", file: !9, line: 69, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_CONTROLLERIN", file: !9, line: 62, size: 96, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Up", scope: !251, file: !9, line: 65, baseType: !8, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Ud", scope: !251, file: !9, line: 66, baseType: !8, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "fy", scope: !251, file: !9, line: 67, baseType: !8, size: 32, offset: 64)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "mModulator", scope: !2, file: !3, line: 66, type: !258, isLocal: false, isDefinition: true)
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 288, elements: !214)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFratemodulator", file: !9, line: 90, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_FALSE_RATE_MODULATOR", file: !9, line: 82, size: 96, elements: !261)
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !260, file: !9, line: 85, baseType: !8, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !260, file: !9, line: 86, baseType: !8, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "Yp", scope: !260, file: !9, line: 87, baseType: !16, size: 8, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "Yn", scope: !260, file: !9, line: 88, baseType: !16, size: 8, offset: 72)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "mThrDistribute", scope: !2, file: !3, line: 67, type: !268, isLocal: false, isDefinition: true)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "SThrDistribute", file: !9, line: 99, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_UPS_2MS", file: !9, line: 93, size: 64, elements: !270)
!270 = !{!271, !272}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "flgABChoose", scope: !269, file: !9, line: 96, baseType: !33, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wPulse", scope: !269, file: !9, line: 97, baseType: !16, size: 8, offset: 32)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "mFWarning", scope: !2, file: !3, line: 68, type: !275, isLocal: false, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "SFWarning", file: !9, line: 120, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_FAULT_WARNING", file: !9, line: 102, size: 224, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "CWsp", scope: !276, file: !9, line: 104, baseType: !16, size: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "CWtf", scope: !276, file: !9, line: 105, baseType: !16, size: 8, offset: 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "Wsp", scope: !276, file: !9, line: 107, baseType: !16, size: 8, offset: 16)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "Wtf", scope: !276, file: !9, line: 108, baseType: !16, size: 8, offset: 24)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "Wav", scope: !276, file: !9, line: 109, baseType: !16, size: 8, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "flgups", scope: !276, file: !9, line: 111, baseType: !16, size: 8, offset: 40)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "flgModeChange", scope: !276, file: !9, line: 112, baseType: !16, size: 8, offset: 48)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "countAV", scope: !276, file: !9, line: 114, baseType: !33, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "countSPLost", scope: !276, file: !9, line: 115, baseType: !33, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "countSPSeen", scope: !276, file: !9, line: 116, baseType: !33, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "countSPset", scope: !276, file: !9, line: 117, baseType: !33, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "countUPSpc", scope: !276, file: !9, line: 118, baseType: !33, size: 32, offset: 192)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 288, elements: !214)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "SControllerParam", file: !9, line: 79, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TAG_CONTROLLER_PARAM", file: !9, line: 72, size: 96, elements: !293)
!293 = !{!294, !295, !296}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "Kp", scope: !292, file: !9, line: 75, baseType: !8, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Kd", scope: !292, file: !9, line: 76, baseType: !8, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "h1", scope: !292, file: !9, line: 77, baseType: !8, size: 32, offset: 64)
!297 = !{i32 7, !"Dwarf Version", i32 5}
!298 = !{i32 2, !"Debug Info Version", i32 3}
!299 = !{i32 1, !"wchar_size", i32 4}
!300 = !{i32 8, !"PIC Level", i32 2}
!301 = !{i32 7, !"PIE Level", i32 2}
!302 = !{i32 7, !"uwtable", i32 2}
!303 = !{i32 7, !"frame-pointer", i32 2}
!304 = !{!"clang version 16.0.0 (https://github.com/zbchen/GVFG-LLVM.git a44eb0d204ec5f401fb9df0f956112e21f6cf859)"}
